# Loading data with Pandas

In [2]:
import pandas as pd

In [9]:
filename = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/LXjSAttmoxJfEG6il1Bqfw/Product-sales.csv"
df = pd.read_csv(filename)
df

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
0,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
1,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
2,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
3,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
4,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   OrderID       5 non-null      int64
 1   Product       5 non-null      object
 2   Category      5 non-null      object
 3   Quantity      5 non-null      int64
 4   Price         5 non-null      int64
 5   Total         5 non-null      int64
 6   OrderDate     5 non-null      object
 7   CustomerCity  5 non-null      object
dtypes: int64(4), object(4)
memory usage: 452.0+ bytes

In [6]:
x = df['Quantity']
x

0     2
1     3
2     5
3    10
4     1
Name: Quantity, dtype: int64

In [10]:
type(x)

pandas.core.series.Series

In [12]:
y = df[['Product','Category','Quantity']]
y

      Product     Category  Quantity
0      Laptop  Electronics         2
1  Smartphone  Electronics         3
2  Desk Chair    Furniture         5
3    Notebook   Stationery        10
4     Monitor  Electronics         1

In [14]:
df.iloc[1,3]

np.int64(3)

In [15]:
df.loc[0,'Product':'Quantity']

Product          Laptop
Category    Electronics
Quantity              2
Name: 0, dtype: object

In [18]:
df.iloc[0:2, 0:3]

   OrderID     Product     Category
0        1      Laptop  Electronics
1        2  Smartphone  Electronics

In [20]:
q=df['Price']
q

0    800
1    600
2    150
3      2
4    300
Name: Price, dtype: int64

In [21]:
q=df[['Product','Category']]
q

      Product     Category
0      Laptop  Electronics
1  Smartphone  Electronics
2  Desk Chair    Furniture
3    Notebook   Stationery
4     Monitor  Electronics

In [23]:
df.iloc[0,2]

'Electronics'

In [24]:
new_index=['a','b','c','d','e']
df_new = df
df.index = new_index
df_new

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
a,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
b,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
c,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
d,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
e,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [26]:
df_new.loc['a','CustomerCity']

'New York'

In [27]:
df.loc['a':'d','CustomerCity']

a       New York
b    Los Angeles
c        Chicago
d        Houston
Name: CustomerCity, dtype: object